Revit 2026 API

# FlexDuctCreate(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IListXYZ) Method

---
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FlexDuct Create(
	Document document,
	ElementId systemTypeId,
	ElementId ductTypeId,
	ElementId levelId,
	XYZ startTangent,
	XYZ endTangent,
	IList<XYZ> points
)
```
```vb
Public Shared Function Create (
	document As Document,
	systemTypeId As ElementId,
	ductTypeId As ElementId,
	levelId As ElementId,
	startTangent As XYZ,
	endTangent As XYZ,
	points As IList(Of XYZ)
) As FlexDuct
```
```cpp
public:
static FlexDuct^ Create(
	Document^ document,
	ElementId^ systemTypeId,
	ElementId^ ductTypeId,
	ElementId^ levelId,
	XYZ^ startTangent,
	XYZ^ endTangent,
	IList<XYZ^>^ points
)
```
```fsharp
static member Create :
        document : Document *
        systemTypeId : ElementId *
        ductTypeId : ElementId *
        levelId : ElementId *
        startTangent : XYZ *
        endTangent : XYZ *
        points : IList<XYZ> -> FlexDuct
```

#### Parameters

document Document

systemTypeId ElementId

ductTypeId ElementId

levelId ElementId

startTangent XYZ

endTangent XYZ

points IListXYZ

#### Return Value

FlexDuct

#### Reference

FlexDuct Class

Create Overload

Autodesk.Revit.DB.Mechanical Namespace